dmadison/ArduinoXInput_Sparkfun/xinput_sparkfun/avr/boards.txt
# Spark Board Contribution Configuration
#
# For more information see:
# * https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5---3rd-party-Hardware-specification
# * https://github.com/arduino/Arduino/wiki/Arduino-Hardware-Cores-migration-guide-from-1.0-to-1.6
#

menu.cpu=Processor

################################################################################
#################################### MaKey MaKey ###############################
################################################################################
makeymakey.name=SparkFun MaKey MaKey w/ XInput
makeymakey.build.board=AVR_MAKEYMAKEY
makeymakey.build.vid.0=0x1B4F
makeymakey.build.pid.0=0x2B74
makeymakey.build.vid.1=0x1B4F
makeymakey.build.pid.1=0x2B75

makeymakey.upload.tool=arduino:avrdude
makeymakey.upload.protocol=avr109
makeymakey.upload.maximum_size=28672
makeymakey.upload.speed=57600
makeymakey.upload.disable_flushing=true
makeymakey.upload.use_1200bps_touch=true
makeymakey.upload.wait_for_upload_port=true

makeymakey.bootloader.low_fuses=0xFF
makeymakey.bootloader.high_fuses=0xD8
makeymakey.bootloader.extended_fuses=0xF8
makeymakey.bootloader.file=caterina/Caterina-makey.hex
makeymakey.bootloader.unlock_bits=0x3F
makeymakey.bootloader.lock_bits=0x2F
makeymakey.bootloader.tool=arduino:avrdude

makeymakey.build.mcu=atmega32u4
makeymakey.build.f_cpu=16000000L
makeymakey.build.vid=0x045E
makeymakey.build.pid=0x028E
makeymakey.build.usb_product="SparkFun MaKey MaKey"
makeymakey.build.core=xinput:arduino
makeymakey.build.variant=promicro
makeymakey.build.extra_flags={build.usb_flags}
makeymakey.build.usb_manufacturer="SparkFun Electronics"


################################################################################
################################## Pro Micro ###################################
################################################################################
promicro.name=SparkFun Pro Micro w/ XInput

promicro.upload.tool=avrdude
promicro.upload.protocol=avr109
promicro.upload.maximum_size=28672
promicro.upload.maximum_data_size=2560
promicro.upload.speed=57600
promicro.upload.disable_flushing=true
promicro.upload.use_1200bps_touch=true
promicro.upload.wait_for_upload_port=true

promicro.bootloader.tool=avrdude
promicro.bootloader.unlock_bits=0x3F
promicro.bootloader.lock_bits=0x2F
promicro.bootloader.low_fuses=0xFF
promicro.bootloader.high_fuses=0xD8

promicro.build.board=AVR_PROMICRO
promicro.build.core=xinput:arduino
promicro.build.variant=promicro
promicro.build.mcu=atmega32u4
promicro.build.usb_product="SparkFun Pro Micro"
promicro.build.vid=0x045E
promicro.build.extra_flags={build.usb_flags}

######################### Pro Micro 3.3V / 8MHz ################################
promicro.menu.cpu.8MHzatmega32U4=ATmega32U4 (3.3V, 8 MHz)

promicro.menu.cpu.8MHzatmega32U4.build.pid.0=0x9203
promicro.menu.cpu.8MHzatmega32U4.build.pid.1=0x9204
promicro.menu.cpu.8MHzatmega32U4.build.pid=0x028E
promicro.menu.cpu.8MHzatmega32U4.build.f_cpu=8000000L

promicro.menu.cpu.8MHzatmega32U4.bootloader.extended_fuses=0xFE
promicro.menu.cpu.8MHzatmega32U4.bootloader.file=caterina/Caterina-promicro8.hex


############################# Pro Micro 5V / 16MHz #############################
promicro.menu.cpu.16MHzatmega32U4=ATmega32U4 (5V, 16 MHz)

promicro.menu.cpu.16MHzatmega32U4.build.pid.0=0x9205
promicro.menu.cpu.16MHzatmega32U4.build.pid.1=0x9206
promicro.menu.cpu.16MHzatmega32U4.build.pid=0x028E
promicro.menu.cpu.16MHzatmega32U4.build.f_cpu=16000000L

promicro.menu.cpu.16MHzatmega32U4.bootloader.extended_fuses=0xCB
promicro.menu.cpu.16MHzatmega32U4.bootloader.file=caterina/Caterina-promicro16.hex


################################################################################
############################## Fio v3 3.3V / 8MHz ##############################
################################################################################
fiov3.name=SparkFun Fio v3 w/ XInput
fiov3.build.board=AVR_FIOV3
fiov3.build.vid.0=0x1B4F
fiov3.build.pid.0=0xF100
fiov3.build.vid.1=0x1B4F
fiov3.build.pid.1=0xF101

fiov3.upload.tool=arduino:avrdude
fiov3.upload.protocol=avr109
fiov3.upload.maximum_size=28672
fiov3.upload.speed=57600
fiov3.upload.disable_flushing=true
fiov3.upload.use_1200bps_touch=true
fiov3.upload.wait_for_upload_port=true

fiov3.bootloader.low_fuses=0xFF
fiov3.bootloader.high_fuses=0xD8
fiov3.bootloader.extended_fuses=0xFC
fiov3.bootloader.file=caterina/Caterina-fio.hex
fiov3.bootloader.unlock_bits=0x3F
fiov3.bootloader.lock_bits=0x2F
fiov3.bootloader.tool=arduino:avrdude

fiov3.build.mcu=atmega32u4
fiov3.build.f_cpu=8000000L
fiov3.build.vid=0x045E
fiov3.build.pid=0x028E
fiov3.build.usb_product="SparkFun Fio v3"
fiov3.build.core=xinput:arduino
fiov3.build.variant=promicro
fiov3.build.extra_flags={build.usb_flags}
fiov3.build.usb_manufacturer="SparkFun Electronics"


################################################################################
################################ Qduino Mini ###################################
################################################################################
qduinomini.name=Qduino Mini w/ XInput
qduinomini.build.vid.0=0x1B4F
qduinomini.build.pid.0=0x514D
qduinomini.build.vid.1=0x1B4F
qduinomini.build.pid.1=0x516D

qduinomini.upload.tool=arduino:avrdude
qduinomini.upload.protocol=avr109
qduinomini.upload.maximum_size=28672
qduinomini.upload.maximum_data_size=2560
qduinomini.upload.speed=57600
qduinomini.upload.disable_flushing=true
qduinomini.upload.use_1200bps_touch=true
qduinomini.upload.wait_for_upload_port=true

qduinomini.bootloader.tool=arduino:avrdude
qduinomini.bootloader.low_fuses=0xFF
qduinomini.bootloader.high_fuses=0xD8
qduinomini.bootloader.extended_fuses=0xCC
qduinomini.bootloader.file=caterina/Caterina-qduinomini.hex
qduinomini.bootloader.unlock_bits=0x3F
qduinomini.bootloader.lock_bits=0x2F

qduinomini.build.mcu=atmega32u4
qduinomini.build.f_cpu=8000000L
qduinomini.build.vid=0x045E
qduinomini.build.pid=0x028E
qduinomini.build.usb_product="Qtechknow Qduino Mini"
qduinomini.build.board=AVR_QDUINOMINI
qduinomini.build.core=xinput:arduino
qduinomini.build.variant=promicro
qduinomini.build.extra_flags={build.usb_flags}
qduinomini.build.usb_manufacturer="SparkFun Electronics"

################################################################################
############################# LilyPad USB Plus #################################
################################################################################

LilyPadProtoUSB.name=LilyPad USB Plus w/ XInput
LilyPadProtoUSB.vid.0=0x1B4F
LilyPadProtoUSB.pid.0=0x0110

LilyPadProtoUSB.upload.tool=avrdude
LilyPadProtoUSB.upload.protocol=avr109
LilyPadProtoUSB.upload.maximum_size=28672
LilyPadProtoUSB.upload.maximum_data_size=2560
LilyPadProtoUSB.upload.speed=57600
LilyPadProtoUSB.upload.disable_flushing=true
LilyPadProtoUSB.upload.use_1200bps_touch=true
LilyPadProtoUSB.upload.wait_for_upload_port=true

LilyPadProtoUSB.bootloader.tool=avrdude
LilyPadProtoUSB.bootloader.low_fuses=0xff
LilyPadProtoUSB.bootloader.high_fuses=0xd8
LilyPadProtoUSB.bootloader.extended_fuses=0xce
LilyPadProtoUSB.bootloader.file=caterina/Caterina-lilypadusbplus.hex
LilyPadProtoUSB.bootloader.unlock_bits=0x3F
LilyPadProtoUSB.bootloader.lock_bits=0x2F

LilyPadProtoUSB.build.mcu=atmega32u4
LilyPadProtoUSB.build.f_cpu=8000000L
LilyPadProtoUSB.build.vid=0x045E
LilyPadProtoUSB.build.pid=0x028E
LilyPadProtoUSB.build.usb_product="LilyPad USB Plus"
LilyPadProtoUSB.build.board=AVR_LILYPAD_ARDUINO_USB_PLUS_BOARD
LilyPadProtoUSB.build.core=xinput:arduino
LilyPadProtoUSB.build.variant=lilypadusbplus
LilyPadProtoUSB.build.extra_flags={build.usb_flags}
